[{"title":"github连接不上","date":"2017-02-10T02:43:14.000Z","path":"2017/02/10/github连接不上/","text":"连接不上了","tags":[]},{"title":"今天是小年","date":"2017-01-20T15:11:53.000Z","path":"2017/01/20/今天是小年/","text":"今天是小年","tags":[]},{"title":"222","date":"2017-01-20T07:53:16.000Z","path":"2017/01/20/222/","text":"666","tags":[]},{"title":"coding","date":"2017-01-20T07:51:43.000Z","path":"2017/01/20/coding/","text":"g","tags":[]},{"title":"假如 Time Machine 恢复时断了电","date":"2017-01-12T13:15:25.000Z","path":"2017/01/12/假如-Time-Machine-恢复时断了电/","text":"给另一台Mac做Time Machine恢复 到一半时断了电 不要悲伤，不要生气 首先把备份文件复制出来 形如「xxx的MacBook Air.sparsebundle」 把受伤的Mac 重启到recover 打开终端 hdiutil attach \\ the/path/to/xxx的MacBook Air.sparsebundle 再在磁盘工具里 先验证，再修复 直接修复，是不行的 会提示无法修复 活动的磁盘 然后，选择恢复Time Machine 并且祈祷 别再一次突然停电","tags":[{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/tags/随笔/"}]},{"title":"楚门的世界","date":"2017-01-11T14:58:47.000Z","path":"2017/01/11/楚门的世界/","text":"我们的时代究竟是一个怎样的时代？技术的发展、物质的充裕，究竟是解放了人还是束缚了人？究竟是把人推向了更加自主的方向，还是把他更加置于自己的对立面，更加失去了自我，更加远离了真实的世界和鲜活的人生？ 《楚门的世界》用一个近乎残忍的故事，以一种寓言式的叙事，给了我们一个耐人寻味的回答。 很显然，楚门只属于楚门的世界——一个被操纵的虚拟世界。他的出生、成长，一切的喜怒哀乐，如果不出意外的话，包括他的死亡，都将在一个被人为操纵和设计好的舞台上上演，并被无以计数的生活于光鲜富足的现代世界的男男女女们驻足观看。他们与楚门融为一体，一起经历着成长的历程，离开楚门，他们的生活将无以为继，世界将大乱，生活将没有意义。 但一场被设计好的持续了三十年之久的旷古未有的真人秀，却终因楚门的疑心和探求欲被击碎了。在楚门历经了人造的风暴、雷电、巨浪的考验后，承载着他走向真相的船，无情地撞破了那个蓝得刺眼的美丽但却虚假的天空。在那一刹那，一个神话结束了，一个阴谋被置于阳光之下。更为重要的是，这深深的撞击，证明只要人性尚存，心灵是无法被永远操纵的。 然而，楚门又绝不仅仅属于楚门的世界。他同时就是生活在这个弥漫着电子硝烟的世界里的你和我。 从出生，到成长，到死去，我们对世界的认识，从来是都是局限的，我们永远无法做到像万能的上帝那样，可以对这个世界了然于胸。我们不得不借助于各种载体来超脱我们的肉体樊篱，从而使得心灵可以通达久远的过去，遥想漫长的未来，想象异邦的人世间，以满足我们无限的好奇心和知识欲望。在这个意义上，我们不得不赞同麦克卢汉的至理名言：“媒介是人体的延伸”。 然而，文明发展的吊诡正在于，它常常走向自身的反面，成为剥夺自由和消解主体性的帮凶。今天，电子媒介在全球范围内的普及和迅速扩张，已经完全实现了麦克卢汉关于“地球村”的天才预言。也正因为如此，全世界的人们才得以在同一个地球上，同时观看楚门的世界，从而在如此广袤的时空范围内把人性中的窥探欲演绎得如此淋漓尽致。 现实的悲剧性正在于，在这个媒介的时代，谁都难以逃脱楚门的命运，谁也没有十足的底气说自己与楚门无关。在各种形式的电视真人秀节目中，难道我们不会见到楚门的影子吗？当我们在为超级女声而狂热欢呼的时候，难道我们不会在自己的身上看到那些抱着电视与楚门厮守的观众的影子吗？在经济利益驱动一切的今天，商业逻辑的泛滥，已经逼迫我们不得不把我们自己玩弄于股掌之间，我们只有自娱自乐，并在狂欢的刹那间，出卖我们的金钱、隐私、自由，乃至生命。 如此看来，《楚门的世界》作为一个时代性的操纵隐喻，不仅讲述了真实和虚假的边界问题，更重要的则是提醒我们走出时代的骗局，走近我们的心灵，在一种顽强的反思中，保有一份不那么时髦的自由。","tags":[{"name":"电影","slug":"电影","permalink":"http://yoursite.com/tags/电影/"}]},{"title":"测试","date":"2017-01-09T05:30:35.000Z","path":"2017/01/09/测试/","text":"成功","tags":[]},{"title":"Hello World","date":"2017-01-09T05:23:18.000Z","path":"2017/01/09/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]}]